// 全局变量:
//flag为标记选择的为北京哪个区
var flag = -1;
//pricel为选择房屋价格的下界
var pricel = -1;
//pricer为选择房屋的上界
var pricer = 99999999;
//为地图的全局变量
var map;
//点的全局变量，伴随具体社区的改变而改变
var mPoint = new BMap.Point(116.404, 39.915);
//社区周边的探索圆，检索附近区域的基本范围
var circle = new BMap.Circle(mPoint, 1500, {
	fillColor: "blue",
	strokeWeight: 1,
	fillOpacity: 0.1,
	strokeOpacity: 0.1
});

var myZoomCtrl;
var myChangeCtrl;
var opts = {
	width: 250, // 信息窗口宽度
	height: 80, // 信息窗口高度
	title: "房屋信息", // 信息窗口标题
	enableMessage: true //设置允许信息窗发送短息
};

var messageControl;
var messageString1 = "区域选择：无限制";
var messageString2 = "价格区间：无限制";


//定义一个控件类
function ZoomControl() {
	this.defaultAnchor = BMAP_ANCHOR_TOP_LEFT;
	this.defaultOffset = new BMap.Size(20, 20)
}
//通过JavaScript的prototype属性继承于BMap.Control
ZoomControl.prototype = new BMap.Control();

//自定义控件必须实现自己的initialize方法，并且将控件的DOM元素返回
//在本方法中创建个div元素作为控件的容器，并将其添加到地图容器中
ZoomControl.prototype.initialize = function(map) {
	//创建一个dom元素
	var div = document.createElement('div');
	//添加文字说明
	div.appendChild(document.createTextNode(messageString1 + " " + messageString2));
	// 设置样式
	div.style.cursor = "pointer";
	div.style.padding = "7px 10px";
	div.style.boxShadow = "0 2px 6px 0 rgba(27, 142, 236, 0.5)";
	div.style.borderRadius = "5px";
	div.style.backgroundColor = "white";
	// 添加DOM元素到地图中
	map.getContainer().appendChild(div);
	// 将DOM元素返回
	return div;
}


//搜索函数2（关注房子的所在区属和价格)
function search2(b, c, d) {
	map.clearOverlays();
	for (var i = 0; i < house.length; i++) {
		if (b == house[i][0] || b == -1) {

			//此时已经满足社区区属的要求
			var pricestr = price[i][1].trim(); //清除字符串的空格
			for (var j = 0; j < pricestr.length; j++) { //将price字符串中的数字提取出来
				if (pricestr[j] >= '0' && pricestr[j] <= '9') {
					continue;
				} else {
					pricestr = pricestr.substring(0, j);
					break;
				}
			}
			var pricee = parseInt(pricestr); //得到当前房屋的价格
			if (pricee >= c && pricee <= d) {
				//此时房屋已经满足所有要求
				//将其加进地图
				var marker = new BMap.Marker(new BMap.Point(house[i][1], house[i][2])); // 创建标注
				var content = "小区：" + price[i][0] + "</br></br>" + "价格：" + price[i][1];
				map.addOverlay(marker); // 将标注添加到地图中
				addClickHandler(content, marker);
			}


		}
	}
}


// 点击社区标记的函数
function addClickHandler(content, marker) {
	marker.addEventListener("click", function(e) {
		map.removeOverlay(circle);
		drawCircle(e);
		openInfo(content, e)
	});

}

function drawCircle(e) {

	var p = e.target;
	mPoint = new BMap.Point(p.getPosition().lng, p.getPosition().lat);
	circle = new BMap.Circle(mPoint, 1500, {
		fillColor: "blue",
		strokeWeight: 1,
		fillOpacity: 0.1,
		strokeOpacity: 0.1
	});

	map.addOverlay(circle);
	map.centerAndZoom(mPoint, 14);
}

function openInfo(content, e) {
	var p = e.target;
	var point = new BMap.Point(p.getPosition().lng, p.getPosition().lat);
	var infoWindow = new BMap.InfoWindow(content, opts); // 创建信息窗口对象 
	map.openInfoWindow(infoWindow, point); //开启信息窗口
}

//控件声明


function searchZone16() { //此为无限制
	flag = -1;
	messageString1 = "区域选择：无限制";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.397228240966, 39.909604560497), 10);
}

function searchZone0() {
	flag = 0;
	messageString1 = "区域选择：东城区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);


	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.422401, 39.934827), 12);
}

function searchZone1() {
	flag = 1;
	messageString1 = "区域选择：西城区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.372514, 39.918124), 12);
}

function searchZone2() {
	flag = 2;
	messageString1 = "区域选择：朝阳区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.449559, 39.926375), 12);
}

function searchZone3() {
	flag = 3;
	messageString1 = "区域选择：丰台区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.292402, 39.864937), 12);
}

function searchZone4() {
	flag = 4;
	messageString1 = "区域选择：石景山区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.292402, 39.864937), 12);
}

function searchZone5() {
	flag = 5;
	messageString1 = "区域选择：海淀区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.305434, 39.96549), 12);

}

function searchZone6() {
	flag = 6;
	messageString1 = "区域选择：门头沟区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.107604, 39.946147), 12);
}

function searchZone7() {
	flag = 7;
	messageString1 = "区域选择：房山区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.149444, 39.754326), 12);
}

function searchZone8() {
	flag = 8;
	messageString1 = "区域选择：通州区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.663415, 39.916017), 12);
}

function searchZone9() {
	flag = 9;
	messageString1 = "区域选择：顺义区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.661424, 40.136351), 12);
}

function searchZone10() {
	flag = 10;
	messageString1 = "区域选择：昌平区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.237618, 40.226413), 12);
}

function searchZone11() {
	flag = 11;
	messageString1 = "区域选择：大兴区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.348625, 39.732555), 12);
}

function searchZone12() {
	flag = 12;
	messageString1 = "区域选择：怀柔区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.638386, 40.322618), 12);
}

function searchZone13() {
	flag = 13;
	messageString1 = "区域选择：平谷区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(117.127379, 40.146951), 12);
}

function searchZone14() {
	flag = 14;
	messageString1 = "区域选择：密云区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(116.849547, 40.382176), 12);
}

function searchZone15() {
	flag = 15;
	messageString1 = "区域选择：延庆区";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
	map.centerAndZoom(new BMap.Point(115.981632, 40.462169), 12);
}

function renew() {
	search2(flag, pricel, pricer);
	circle = new BMap.Circle(mPoint, 1500, {
		fillColor: "blue",
		strokeWeight: 1,
		fillOpacity: 0.1,
		strokeOpacity: 0.1
	});

	map.addOverlay(circle);
}

function searchNearby1() {
	renew();
	var local = new BMap.LocalSearch(map, {
		renderOptions: {
			map: map,
			autoViewport: false
		}
	});

	local.searchNearby('医院', mPoint, 1500);
}

function searchNearby2() {
	renew();
	var local = new BMap.LocalSearch(map, {
		renderOptions: {
			map: map,
			autoViewport: false
		}
	});
	local.searchNearby('地铁', mPoint, 1500);
}

function searchNearby3() {
	renew();
	var local = new BMap.LocalSearch(map, {
		renderOptions: {
			map: map,
			autoViewport: false
		}
	});
	local.searchNearby('餐厅', mPoint, 1500);
}

function searchNearby4() {
	renew();
	var local = new BMap.LocalSearch(map, {
		renderOptions: {
			map: map,
			autoViewport: false
		}
	});
	local.searchNearby('学校', mPoint, 1500);
}

function searchNearby5() {
	renew();
	var local = new BMap.LocalSearch(map, {
		renderOptions: {
			map: map,
			autoViewport: false
		}
	});
	local.searchNearby('超市', mPoint, 1500);
}

function searchPrice6() { //表示不限制
	pricel = -1;
	pricer = 99999999;
	messageString2 = "价格区间：无限制";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
}

function searchPrice3() {
	//重新调用search的第二版函数
	pricel = 30000;
	pricer = 60000;
	messageString2 = "价格区间:[30000,60000]";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	search2(flag, pricel, pricer);
}

function searchPrice4() {
	pricel = 60000;
	pricer = 90000;
	messageString2 = "价格区间：[60000,90000]";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	//重新调用search的第二版函数
	search2(flag, pricel, pricer);
}

function searchPrice5() {
	pricel = 90000;
	pricer = 10000000;
	messageString2 = "价格区间：[90000,10000000]";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	//重新调用search的第二版函数
	search2(flag, pricel, pricer);
}

function searchPrice1() {
	pricel = 0;
	pricer = 15000;
	messageString2 = "价格区间:[0,15000]";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	//重新调用search的第二版函数
	search2(flag, pricel, pricer);
}

function searchPrice2() {
	pricel = 15000;
	pricer = 30000;
	messageString2 = "价格区间：[15000,30000]";
	map.removeControl(myZoomCtrl);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);
	//重新调用search的第二版函数
	search2(flag, pricel, pricer);
}






//JQ

//添加一个窗体函数，用来隐藏箭头
$(document).ready(function() {
	/* 窗体滚动事件 */
	$(window).scroll(function() {
		//判断滚动条的垂直位置是否大于0，说白了就是：判断滚动条是否在顶部
		if ($(window).scrollTop() > 0) {
			$("#button1").stop(true, false).animate({
				bottom: "-300px"
			}, 1000); //动画隐藏ID="doTop"的这个层
			// $("#button1").hide(),1000); //动画隐藏ID="doTop"的这个层
		} else {
			$("#button1").stop(true, false).animate({
				bottom: "30px"
			}, 1000); //动画显示ID="doTop"的这个层
			// $("#button1").show(),1000);  //动画显示ID="doTop"的这个层
		}
	});

	// /* 点击返回顶部箭头的事件 */
	// $("#btntop").click(function(){
	//         $("body,html").animate({scrollTop:0},500); //返回顶部，用JQ的animate动画
	// });


	/* 点击返回底部箭头的事件 */
	$("#button1").click(function() {
		$("body,html").animate({
			scrollTop: document.body.clientHeight
		}, 700); //返回底部，用JQ的animate动画
	});


});


//数据区域
//price为不同社区的房价
//house为社区的所属区域编号和经纬度
var price = [
	["	霞公府	", "	132059元/平米	"],
	["	灯市口小区	", "	102744元/平米	"],
	["	新世界太华公寓	", "	71087元/平米	"],
	["	海运仓	", "	100564元/平米	"],
	["	新世界家园	", "	134163元/平米	"],
	["	新裕家园	", "	114511元/平米	"],
	["	朱雀门	", "	135445元/平米	"],
	["	六铺炕二区	", "	138897元/平米	"],
	["	珠江骏景	", "	56010元/平米	"],
	["	西罗园南里	", "	55718元/平米	"],
	["	洋桥北里	", "	59237元/平米	"],
	["	新世界丽樽	", "	2000万元/套	"],
	["	滨河小区	", "	38739元/平米	"],
	["	观澜国际公寓	", "	26109元/平米	"],
	["	水上华城	", "	99751元/平米	"],
	["	朗琴园	", "	104275元/平米	"],
	["	清芷园	", "	105582元/平米	"],
	["	三里河二区	", "	105423元/平米	"],
	["	宣武门西大街	", "	102347元/平米	"],
	["	三里河一区	", "	111828元/平米	"],
	["	中信城二期	", "	154026元/平米	"],
	["	车公庄北里	", "	100740元/平米	"],
	["	畅柳园	", "	103603元/平米	"],
	["	北礼士路小区	", "	102632元/平米	"],
	["	牛街东里	", "	87946元/平米	"],
	["	乐城	", "	78199元/平米	"],
	["	三里河三区	", "	107583元/平米	"],
	["	庄胜二期	", "	144477元/平米	"],
	["	中信城一期	", "	143105元/平米	"],
	["	常青藤嘉园	", "	89284元/平米	"],
	["	牛街西里	", "	85029元/平米	"],
	["	一瓶	", "	136839元/平米	"],
	["	小红庙	", "	93048元/平米	"],
	["	复兴门外大街小区	", "	124785元/平米	"],
	["	中信城三期	", "	159925元/平米	"],
	["	西便门东里	", "	98429元/平米	"],
	["	康乐里	", "	115947元/平米	"],
	["	恬心家园	", "	89203元/平米	"],
	["	玉桃园	", "	102090元/平米	"],
	["	红莲晴园	", "	75576元/平米	"],
	["	新文化街小区	", "	140550元/平米	"],
	["	金泰城丽湾	", "	85639元/平米	"],
	["	太平桥小区	", "	69759元/平米	"],
	["	今典花园	", "	92174元/平米	"],
	["	甘家口小区	", "	91543元/平米	"],
	["	建设部大院	", "	115160元/平米	"],
	["	文慧园	", "	90449元/平米	"],
	["	索家坟小区	", "	85457元/平米	"],
	["	清和园	", "	40710元/平米	"],
	["	首创新悦都	", "	40040元/平米	"],
	["	首创澜茵山	", "	19815元/平米	"],
	["	融城园	", "	25709元/平米	"],
	["	星河湾	", "	88128元/平米	"],
	["	合生·霄云路8号	", "	5888万元/套	"],
	["	新城国际	", "	118368元/平米	"],
	["	阳光上东	", "	90740元/平米	"],
	["	太阳公元	", "	145276元/平米	"],
	["	棕榈泉国际公寓	", "	101047元/平米	"],
	["	公园大道	", "	99962元/平米	"],
	["	观唐中式宅院	", "	82312元/平米	"],
	["	北苑家园茉藜园	", "	52113元/平米	"],
	["	芍药居北里	", "	77163元/平米	"],
	["	北京新天地	", "	54219元/平米	"],
	["	紫御华府	", "	98721元/平米	"],
	["	国奥村	", "	125543元/平米	"],
	["	北京华侨城	", "	74357元/平米	"],
	["	林奥嘉园	", "	55544元/平米	"],
	["	丽都水岸	", "	89847元/平米	"],
	["	中粮瑞府	", "	4900万元/套	"],
	["	北苑家园望春园	", "	60414元/平米	"],
	["	北苑家园清友园	", "	51695元/平米	"],
	["	后现代城	", "	71375元/平米	"],
	["	华远裘马都	", "	94196元/平米	"],
	["	首城国际中心	", "	95069元/平米	"],
	["	东湖湾	", "	106466元/平米	"],
	["	红玺台	", "	154428元/平米	"],
	["	望京新城	", "	66629元/平米	"],
	["	保利金泉	", "	88835元/平米	"],
	["	道家园小区	", "	63447元/平米	"],
	["	远洋天地	", "	71821元/平米	"],
	["	富力十号	", "	152258元/平米	"],
	["	京棉新城	", "	57836元/平米	"],
	["	国美第一城	", "	63089元/平米	"],
	["	逸翠园	", "	91863元/平米	"],
	["	爱这城	", "	78869元/平米	"],
	["	百环家园	", "	57117元/平米	"],
	["	富贵园	", "	113846元/平米	"],
	["	幸福家园	", "	102104元/平米	"],
	["	花市枣苑	", "	102680元/平米	"],
	["	豆瓣小区	", "	116768元/平米	"],
	["	左安浦园	", "	77074元/平米	"],
	["	崇文门东大街	", "	94253元/平米	"],
	["	和平里砖角楼	", "	71047元/平米	"],
	["	东方银座	", "	80146元/平米	"],
	["	金桥国际公寓	", "	82126元/平米	"],
	["	小黄庄小区	", "	106233元/平米	"],
	["	朝阳门内大街	", "	99491元/平米	"],
	["	贡院9号	", "	88108元/平米	"],
	["	贡院六号	", "	109232元/平米	"],
	["	雍和家园	", "	96474元/平米	"],
	["	六铺炕二区	", "	138897元/平米	"],
	["	太平桥西里	", "	67435元/平米	"],
	["	芳星园三区	", "	62199元/平米	"],
	["	领秀翡翠山	", "	65000元/平	"],
	["	紫芳园	", "	70756元/平米	"],
	["	太平桥东里	", "	67915元/平米	"],
	["	泰禾拾景园	", "	47034元/平米	"],
	["	合生世界花园	", "	27387元/平米	"],
	["	金隅花石匠	", "	56626元/平米	"],
	["	依翠园	", "	51755元/平米	"],
	["	凯德麓语	", "	1700万元/套	"],
	["	佳运园	", "	51507元/平米	"],
	["	北京玫瑰园	", "	54025元/平米	"],
	["	金色漫香林	", "	55496元/平米	"],
	["	北京城建海梓府	", "	1400万元/套	"],
	["	宣颐家园	", "	50872元/平米	"],
	["	丽宫	", "	73114元/平米	"],
	["	嘉浩国际城	", "	56888元/平米	"],
	["	顺鑫朗郡	", "	30067元/平米	"],
	["	中国铁建梧桐苑	", "	48218元/平米	"],
	["	北京城建上河湾	", "	28000元/平	"],
	["	饮马川·Club Med长城度假村	", "	29671元/平米	"],
	["	观唐云鼎	", "	31000元/平	"],
	["	栖美国际	", "	30401元/平米	"],
	["	中昂邑上原著	", "	26000元/平	"],
	["	妫河丽景	", "	26263元/平米	"],
	["	角门东里	", "	51153元/平米	"],
	["	三环新城	", "	56951元/平米	"],
	["	晓月苑	", "	41066元/平米	"],
	["	玺萌鹏苑	", "	63897元/平米	"],
	["	天恒金融街公园懿府	", "	74000元/平	"],
	["	怡海花园恒泰园	", "	65020元/平米	"],
	["	洋桥北里	", "	59237元/平米	"],
	["	沸城	", "	42218元/平米	"],
	["	怡海花园富泽园	", "	61112元/平米	"],
	["	银地家园	", "	46686元/平米	"],
	["	丰体时代花园	", "	48253元/平米	"],
	["	怡海花园富润园	", "	58335元/平米	"],
	["	万年花城二期	", "	67885元/平米	"],
	["	中海九号公馆	", "	80524元/平米	"],
	["	南珠苑	", "	58339元/平米	"],
	["	奈伦熙府	", "	54595元/平米	"],
	["	百合园	", "	45074元/平米	"],
	["	天恒乐活城	", "	31785元/平米	"],
	["	天恒水岸壹号	", "	52000元/平	"],
	["	天恒别墅山	", "	33151元/平米	"],
	["	新景家园	", "	104654元/平米	"],
	["	模式口西里	", "	44164元/平米	"],
	["	金顶阳光	", "	47218元/平米	"],
	["	五芳园	", "	52170元/平米	"],
	["	京汉旭城	", "	65641元/平米	"],
	["	重聚园	", "	52843元/平米	"],
	["	金顶街三区	", "	47426元/平米	"],
	["	古城西路小区	", "	46152元/平米	"],
	["	模式口南里	", "	46840元/平米	"],
	["	石景山杨庄小区	", "	47229元/平米	"],
	["	古城北路小区	", "	45888元/平米	"],
	["	西引力	", "	57775元/平米	"],
	["	模式口东里	", "	44551元/平米	"],
	["	曦景长安	", "	47822元/平米	"],
	["	金顶街五区	", "	47892元/平米	"],
	["	诗景长安	", "	64956元/平米	"],
	["	金福苑	", "	47455元/平米	"],
	["	金地格林小镇	", "	55679元/平米	"],
	["	鸿顺园小区	", "	32855元/平米	"],
	["	绿岛家园	", "	40310元/平米	"],
	["	桃园小区	", "	34235元/平米	"],
	["	含晖苑	", "	41085元/平米	"],
	["	门头沟月季园小区	", "	38964元/平米	"],
	["	大峪南路小区	", "	40940元/平米	"],
	["	倚山嘉园	", "	38339元/平米	"],
	["	双峪小区	", "	38353元/平米	"],
	["	门头沟永安小区	", "	36216元/平米	"],
	["	阳光都市	", "	96109元/平米	"],
	["	玉桃园	", "	102090元/平米	"],
	["	玉海园	", "	71606元/平米	"],
	["	华清嘉园	", "	113873元/平米	"],
	["	香山清琴	", "	132422元/平米	"],
	["	上地东里	", "	102838元/平米	"],
	["	北京御园	", "	115354元/平米	"],
	["	双榆树东里	", "	89838元/平米	"],
	["	展春园	", "	83374元/平米	"],
	["	韦伯豪家园	", "	98391元/平米	"],
	["	小南庄	", "	92537元/平米	"],
	["	太月园	", "	85000元/平米	"],
	["	水木天成	", "	64808元/平米	"],
	["	翠微路2号院	", "	96325元/平米	"],
	["	满庭芳园	", "	73990元/平米	"],
	["	缘溪堂	", "	103139元/平米	"],
	["	双榆树北里	", "	91039元/平米	"],
	["	育新花园	", "	75200元/平米	"],
	["	芙蓉里	", "	84709元/平米	"],
	["	曙光花园望山园	", "	86386元/平米	"],
	["	西钓鱼台嘉园	", "	100525元/平米	"],
	["	皂君东里	", "	94004元/平米	"],
	["	世纪城翠叠园	", "	110997元/平米	"],
	["	四海公寓	", "	25192元/平米	"],
	["	远洋山水	", "	75225元/平米	"],
	["	西山枫林	", "	51911元/平米	"],
	["	八角北里	", "	51434元/平米	"],
	["	八角南里	", "	53417元/平米	"],
	["	八角中里	", "	52939元/平米	"],
	["	建西苑南里	", "	63051元/平米	"],
	["	建西苑北里	", "	64190元/平米	"],
	["	远洋沁山水	", "	89988元/平米	"],
	["	石景山杨庄小区	", "	47229元/平米	"],
	["	金地格林小镇	", "	55679元/平米	"],
	["	首创新悦都	", "	40040元/平米	"],
	["	首创澜茵山	", "	19815元/平米	"],
	["	首城汇景湾	", "	23207元/平米	"],
	["	首城汇景墅	", "	666万元/套	"],
	["	紫贵御园	", "	29000元/平	"],
	["	Naga上院	", "	102069元/平米	"],
	["	北官厅胡同	", "	114388元/平米	"],
	["	大雄郁金香舍	", "	56328元/平米	"],
	["	京西金泰丽湾	", "	42323元/平米	"],
	["	绿岛家园	", "	40310元/平米	"],
	["	桃园小区	", "	34235元/平米	"],
	["	门头沟月季园小区	", "	38964元/平米	"],
	["	大峪南路小区	", "	40940元/平米	"],
	["	京投发展檀香府	", "	50000元/平	"],
	["	惠泽家园	", "	33098元/平米	"],
	["	剧场东街小区	", "	33262元/平米	"],
	["	冯村嘉园	", "	39875元/平米	"],
	["	中门寺小区	", "	23255元/平米	"],
	["	柏林山水	", "	24253元/平米	"],
	["	海特花园	", "	49015元/平米	"],
	["	中粮万科长阳半岛	", "	45521元/平米	"],
	["	瑞雪春堂	", "	35891元/平米	"],
	["	腾龙家园	", "	21771元/平米	"],
	["	北京城建琨廷	", "	32000元/平	"],
	["	金地朗悦	", "	45610元/平米	"],
	["	西潞园小区	", "	32913元/平米	"],
	["	西棕榈滩	", "	29790元/平米	"],
	["	房山世界名园	", "	21456元/平米	"],
	["	中国铁建国际花园	", "	41173元/平米	"],
	["	金域缇香	", "	40414元/平米	"],
	["	沁园春景	", "	23093元/平米	"],
	["	中冶蓝城	", "	25578元/平米	"],
	["	燕化星城	", "	27674元/平米	"],
	["	碧波园温泉家园	", "	28417元/平米	"],
	["	格调	", "	99436元/平米	"],
	["	世纪星城	", "	51477元/平米	"],
	["	天时名苑	", "	51095元/平米	"],
	["	K2海棠湾	", "	58062元/平米	"],
	["	珠江逸景家园	", "	31164元/平米	"],
	["	珠江拉维小镇	", "	42385元/平米	"],
	["	K2清水湾	", "	63771元/平米	"],
	["	西潞苑	", "	41029元/平米	"],
	["	BDA样本	", "	32701元/平米	"],
	["	DBC加州小镇	", "	51887元/平米	"],
	["	富力尚悦居	", "	36706元/平米	"],
	["	融科钧廷	", "	38531元/平米	"],
	["	K2玉兰湾	", "	63393元/平米	"],
	["	月亮城堡	", "	49131元/平米	"],
	["	武夷花园牡丹园	", "	47921元/平米	"],
	["	武夷花园小区	", "	51154元/平米	"],
	["	新城阳光	", "	48511元/平米	"],
	["	澜花语岸	", "	45527元/平米	"],
	["	V7九间堂	", "	1800万元/套	"],
	["	富河园	", "	46305元/平米	"],
	["	金桥滨河丽舍	", "	29467元/平米	"],
	["	新华联慧谷	", "	27032元/平米	"],
	["	财富公馆	", "	47831元/平米	"],
	["	泰禾北京院子	", "	2700万元/套	"],
	["	马家堡西里	", "	54539元/平米	"],
	["	蓝天花园	", "	24308元/平米	"],
	["	优山美地	", "	61092元/平米	"],
	["	誉天下	", "	65000元/平	"],
	["	名都园别墅	", "	71345元/平米	"],
	["	丽高王府	", "	60900元/平米	"],
	["	棕榈滩别墅	", "	10000万元/套	"],
	["	美林香槟小镇	", "	43989元/平米	"],
	["	蓝岸丽舍	", "	26425元/平米	"],
	["	莱蒙湖	", "	47313元/平米	"],
	["	胜利小区	", "	39589元/平米	"],
	["	仓上小区	", "	37258元/平米	"],
	["	香蜜湾	", "	52418元/平米	"],
	["	中景江山赋	", "	60618元/平米	"],
	["	馨港庄园三区	", "	34463元/平米	"],
	["	富力湾	", "	28801元/平米	"],
	["	怡馨家园	", "	44748元/平米	"],
	["	中国铁建绿港	", "	26092元/平米	"],
	["	桃花源木墅	", "	6644元/平米	"],
	["	海关西园	", "	72327元/平米	"],
	["	润泽庄园	", "	83502元/平米	"],
	["	法华寺南里	", "	88948元/平米	"],
	["	真武庙	", "	113559元/平米	"],
	["	领秀新硅谷	", "	86506元/平米	"],
	["	枫丹丽舍	", "	70098元/平米	"],
	["	旗胜家园	", "	47607元/平米	"],
	["	东方普罗旺斯	", "	54393元/平米	"],
	["	天通苑西三区	", "	32854元/平米	"],
	["	天通苑东一区	", "	37761元/平米	"],
	["	温哥华森林	", "	2500万元/套	"],
	["	碧水庄园	", "	67857元/平米	"],
	["	保利垄上	", "	32717元/平米	"],
	["	天通苑北一区	", "	38888元/平米	"],
	["	融泽嘉园	", "	51798元/平米	"],
	["	温泉花园	", "	31097元/平米	"],
	["	名佳花园三区	", "	39396元/平米	"],
	["	天通苑北二区	", "	37895元/平米	"],
	["	天通苑西二区	", "	33901元/平米	"],
	["	天通苑东二区	", "	37412元/平米	"],
	["	领秀慧谷	", "	58500元/平	"],
	["	远洋傲北	", "	45833元/平米	"],
	["	天通苑北三区	", "	36309元/平米	"],
	["	天通苑东三区	", "	37160元/平米	"],
	["	西湖新村	", "	33733元/平米	"],
	["	北京太阳城	", "	33024元/平米	"],
	["	天通苑西一区	", "	37102元/平米	"],
	["	北京壹号庄园	", "	5000万元/	"],
	["	新龙城	", "	55894元/平米	"],
	["	麦卡伦地	", "	35910元/平米	"],
	["	冠雅苑	", "	36297元/平米	"],
	["	天通苑本四区	", "	42469元/平米	"],
	["	金科王府	", "	46916元/平米	"],
	["	金隅万科城	", "	43368元/平米	"],
	["	威尼斯花园	", "	31964元/平米	"],
	["	汤HOUSE别墅	", "	32002元/平米	"],
	["	金科王府洋房	", "	42303元/平米	"],
	["	流星花园三区	", "	54968元/平米	"],
	["	北京北	", "	58295元/平米	"],
	["	万科四季花城	", "	48979元/平米	"],
	["	万科幸福汇	", "	26304元/平米	"],
	["	阳光邑上	", "	36256元/平米	"],
	["	粮食局家属楼	", "	21578元/平米	"],
	["	10AM新坐标	", "	71846元/平米	"],
	["	中国铁建北京山语城	", "	25000元/平	"],
	["	金地格林小镇6	", "	38905元/平米	"],
	["	鸿坤林语墅	", "	2700万元/套	"],
	["	枫丹壹号	", "	64300元/平米	"],
	["	亦庄金茂悦	", "	68000元/平	"],
	["	大兴育新花园	", "	24919元/平米	"],
	["	亦庄北岸	", "	49875元/平米	"],
	["	鸿坤理想城	", "	59242元/平米	"],
	["	亦庄金茂府	", "	1400万元/套	"],
	["	彩虹新城	", "	51060元/平米	"],
	["	一品亦庄	", "	45972元/平米	"],
	["	保利茉莉公馆	", "	60045元/平米	"],
	["	紫禁壹号院	", "	4000万元/套	"],
	["	保利春天里	", "	46147元/平米	"],
	["	芳源里	", "	47405元/平米	"],
	["	清逸园	", "	41804元/平米	"],
	["	郁花园一里	", "	45193元/平米	"],
	["	听涛雅苑	", "	51932元/平米	"],
	["	中粮京西祥云	", "	58000元/平	"],
	["	新桥南大街小区	", "	40714元/平米	"],
	["	幸福东园	", "	26034元/平米	"],
	["	人济山庄	", "	115235元/平米	"],
	["	一渡新新小镇	", "	13000元/平	"],
	["	观山源墅	", "	47500元/平	"],
	["	峪园小区	", "	32391元/平米	"],
	["	欧郡香水城	", "	25668元/平米	"],
	["	湖光小区	", "	31868元/平米	"],
	["	怀柔东关一区	", "	31778元/平米	"],
	["	乐红园小区	", "	33247元/平米	"],
	["	于家园二区	", "	30106元/平米	"],
	["	怀柔潘家园小区	", "	29125元/平米	"],
	["	东园小区	", "	32203元/平米	"],
	["	于家园一区	", "	30843元/平米	"],
	["	康馨家园	", "	30208元/平米	"],
	["	宽沟9号	", "	26269元/平米	"],
	["	青春路一院	", "	31952元/平米	"],
	["	家天下儒风	", "	35494元/平米	"],
	["	怡安园	", "	23750元/平米	"],
	["	泊岸	", "	40138元/平米	"],
	["	府前东街小区	", "	32782元/平米	"],
	["	怀柔开放路	", "	25873元/平米	"],
	["	西园	", "	29864元/平米	"],
	["	莲馨苑	", "	29323元/平米	"],
	["	山水文园五期	", "	93779元/平米	"],
	["	汽南小区	", "	109547元/平米	"],
	["	滨河西里	", "	43209元/平米	"],
	["	滨河临镜苑	", "	43556元/平米	"],
	["	滨河霁月园	", "	40278元/平米	"],
	["	滨河德露苑	", "	38725元/平米	"],
	["	滨河绮霞苑	", "	42470元/平米	"],
	["	平谷滨河小区	", "	20758元/平米	"],
	["	平谷金谷园	", "	25550元/平米	"],
	["	平谷瑞丰花园	", "	24657元/平米	"],
	["	腾飞园	", "	20239元/平米	"],
	["	乐园西小区	", "	22118元/平米	"],
	["	平谷怡馨家园	", "	24188元/平米	"],
	["	平谷锦绣花园	", "	23474元/平米	"],
	["	平谷幸福小区	", "	24561元/平米	"],
	["	平谷南小区	", "	21466元/平米	"],
	["	平谷胜利小区	", "	24792元/平米	"],
	["	兴谷家园	", "	19033元/平米	"],
	["	乐园东小区	", "	22233元/平米	"],
	["	南岔子街小区	", "	25317元/平米	"],
	["	平谷永安家园	", "	23708元/平米	"],
	["	啤酒厂家属楼	", "	24930元/平米	"],
	["	右外东庄	", "	64371元/平米	"],
	["	蓝桥驿苑	", "	33339元/平米	"],
	["	行宫小区	", "	28655元/平米	"],
	["	保利花园	", "	25939元/平米	"],
	["	涧桥山	", "	25233元/平米	"],
	["	密西花园小区	", "	21191元/平米	"],
	["	花园小区	", "	23397元/平米	"],
	["	明珠花园	", "	18956元/平米	"],
	["	密云世纪家园	", "	25138元/平米	"],
	["	果园新里	", "	25487元/平米	"],
	["	密云鼓楼小区	", "	28747元/平米	"],
	["	银河花园别墅	", "	29487元/平米	"],
	["	蓝河湾	", "	27447元/平米	"],
	["	果园新里中区	", "	22952元/平米	"],
	["	季庄小区	", "	21198元/平米	"],
	["	麓秀佳园	", "	15573元/平米	"],
	["	滨河园	", "	35414元/平米	"],
	["	彩虹园小区	", "	22969元/平米	"],
	["	密云行宫小区	", "	25551元/平米	"],
	["	石桥小区	", "	21470元/平米	"],
	["	密云银河湾	", "	27817元/平米	"],
	["	瑞海姆公寓	", "	24905元/平米	"],
	["	泉河园二区	", "	30857元/平米	"],
	["	长城观止	", "	28801元/平米	"],
	["	首开国风美仑	", "	38359元/平米	"],
	["	苹果园三区	", "	45359元/平米	"],
	["	空港吉祥花园	", "	52668元/平米	"],
	["	首开熙悦山	", "	41739元/平米	"],
	["	川北小区	", "	27126元/平米	"],
	["	延庆北关小区	", "	20838元/平米	"],
	["	南菜园	", "	21799元/平米	"],
	["	尚书苑小区	", "	25767元/平米	"],
	["	湖南小区	", "	25157元/平米	"],
	["	舜泽园	", "	26008元/平米	"],
	["	莲花苑小区	", "	23016元/平米	"],
	["	石河营小区	", "	22407元/平米	"],
	["	清凉盛景	", "	32985元/平米	"],
	["	胜芳园小区	", "	22236元/平米	"],
	["	龙聚山庄	", "	16497元/平米	"],
	["	原乡墅	", "	22140元/平米	"],
	["	悦泽苑	", "	26706元/平米	"],
	["	湖北小区	", "	26265元/平米	"],
	["	麦金利山	", "	10567元/平米	"]


];
var house = [
	[0, 116.414513, 39.916203],
	[0, 116.421207, 39.924417],
	[0, 116.425841, 39.902912],
	[0, 116.435055, 39.941656],
	[0, 116.423385, 39.900907],
	[0, 116.433184, 39.899096],
	[0, 116.395527, 39.883401],
	[0, 116.395892, 39.960884],
	[0, 116.402092, 39.858968],
	[0, 116.400183, 39.867284],
	[0, 116.392378, 39.859085],
	[0, 116.425841, 39.902912],
	[0, 116.396784, 39.957383],
	[0, 116.387935, 39.956109],
	[0, 116.359938, 39.896558],
	[1, 116.348044, 39.892548],
	[1, 116.378651, 39.879909],
	[1, 116.349279, 39.916453],
	[1, 116.375243, 39.901152],
	[1, 116.348813, 39.920801],
	[1, 116.381481, 39.891221],
	[1, 116.34081, 39.939085],
	[1, 116.389672, 39.888392],
	[1, 116.359665, 39.939686],
	[1, 116.370158, 39.891467],
	[1, 116.345796, 39.882231],
	[1, 116.348813, 39.920801],
	[1, 116.382192, 39.902755],
	[1, 116.381481, 39.891221],
	[1, 116.339806, 39.88577],
	[1, 116.370158, 39.891467],
	[1, 116.391062, 39.884326],
	[1, 116.344473, 39.887291],
	[1, 116.346358, 39.912503],
	[1, 116.381481, 39.891221],
	[1, 116.359782, 39.906311],
	[1, 116.373999, 39.901566],
	[1, 116.36369, 39.884277],
	[1, 116.3653, 39.947823],
	[1, 116.340354, 39.885438],
	[1, 116.373048, 39.909483],
	[1, 116.348923, 39.87603],
	[1, 116.326072, 39.893457],
	[1, 116.36636, 39.959313],
	[1, 116.331986, 39.935244],
	[1, 116.339851, 39.934165],
	[1, 116.368956, 39.955278],
	[1, 116.367303, 39.957655],
	[1, 116.382683, 39.91648],
	[1, 116.352718, 39.94357],
	[1, 116.352718, 39.94357],
	[1, 116.358044, 39.934347],
	[2, 116.529673, 39.934842],
	[2, 116.486438, 39.968643],
	[2, 116.462153, 39.923909],
	[2, 116.48844, 39.971832],
	[2, 116.448508, 39.987459],
	[2, 116.486924, 39.938331],
	[2, 116.492829, 39.938195],
	[2, 116.42295, 40.000943],
	[2, 116.422961, 40.04646],
	[2, 116.449027, 39.984813],
	[2, 116.612353, 39.921262],
	[2, 116.416189, 40.047239],
	[2, 116.386949, 40.014214],
	[2, 116.50958, 39.87379],
	[2, 116.414313, 40.040838],
	[2, 116.490589, 39.97553],
	[2, 116.525971, 40.055787],
	[2, 116.422961, 40.04646],
	[2, 116.422961, 40.04646],
	[2, 116.493992, 39.905758],
	[2, 116.465686, 39.972158],
	[2, 116.47634, 39.897995],
	[2, 116.466926, 40.012545],
	[2, 116.445734, 39.985446],
	[2, 116.479199, 40.004227],
	[2, 116.442918, 40.028084],
	[2, 116.49242, 39.931677],
	[2, 116.498899, 39.91906],
	[2, 116.461138, 39.903885],
	[2, 116.513017, 39.923669],
	[2, 116.517877, 39.940203],
	[2, 116.529257, 39.949494],
	[2, 116.514321, 39.918642],
	[2, 116.471439, 39.896423],
	[2, 116.439836, 39.903297],
	[2, 116.423486, 39.974925],
	[2, 116.435191, 39.903196],
	[2, 116.500297, 39.979388],
	[2, 116.444575, 39.879608],
	[2, 116.493795, 39.926532],
	[2, 116.428887, 39.964871],
	[2, 116.441968, 39.946128],
	[2, 116.448768, 39.901746],
	[2, 116.420621, 39.971001],
	[2, 116.494079, 39.926631],
	[2, 116.438014, 39.916623],
	[2, 116.438014, 39.916623],
	[2, 116.426538, 39.956707],
	[2, 116.395892, 39.960884],
	[2, 116.554308, 40.023724],
	[2, 116.44201, 39.8665],
	[2, 116.502742, 39.92208],
	[2, 116.446613, 39.867714],
	[2, 116.554308, 40.023724],
	[2, 116.469789, 39.912516],
	[2, 116.486438, 39.968643],
	[2, 116.518337, 39.922033],
	[2, 116.520085, 39.8441],
	[2, 116.47517, 39.998627],
	[2, 116.408252, 40.052082],
	[2, 116.38833, 39.976554],
	[2, 116.454683, 39.84164],
	[2, 116.432138, 40.042512],
	[2, 116.459069, 39.817212],
	[2, 116.441913, 39.940297],
	[2, 116.446312, 40.052313],
	[2, 116.476067, 39.860895],
	[2, 116.551943, 39.949077],
	[2, 116.432138, 40.042512],
	[2, 116.520354, 39.928814],
	[2, 116.42295, 40.000943],
	[2, 116.606108, 39.92044],
	[2, 116.465885, 39.961529],
	[2, 116.392542, 39.971201],
	[3, 116.384927, 39.852186],
	[3, 116.313995, 39.857226],
	[3, 116.244708, 39.845675],
	[3, 116.368951, 39.857778],
	[3, 116.334905, 39.84643],
	[3, 116.308407, 39.837515],
	[3, 116.392378, 39.859085],
	[3, 116.248924, 39.839167],
	[3, 116.308407, 39.837515],
	[3, 116.336509, 39.821771],
	[3, 116.276816, 39.87232],
	[3, 116.308407, 39.837515],
	[3, 116.327617, 39.849793],
	[3, 116.302086, 39.824297],
	[3, 116.36691, 39.854774],
	[3, 116.314608, 39.890056],
	[3, 116.369891, 39.866819],
	[3, 116.334905, 39.84643],
	[3, 116.334905, 39.84643],
	[3, 116.334905, 39.84643],
	[4, 116.123103, 39.95947],
	[4, 116.159688, 39.939205],
	[4, 116.173555, 39.932806],
	[4, 116.233636, 39.904665],
	[4, 116.233527, 39.895668],
	[4, 116.233529, 39.900201],
	[4, 116.177349, 39.9324],
	[4, 116.192537, 39.921609],
	[4, 116.16655, 39.938035],
	[4, 116.203971, 39.925095],
	[4, 116.197442, 39.923578],
	[4, 116.216221, 39.907854],
	[4, 116.174891, 39.940416],
	[4, 116.192151, 39.91435],
	[4, 116.172405, 39.931899],
	[4, 116.226248, 39.90555],
	[4, 116.176856, 39.937936],
	[4, 116.246865, 39.90676],
	[4, 116.202523, 39.940007],
	[4, 116.111886, 39.948245],
	[4, 116.112072, 39.932639],
	[4, 116.126204, 39.934416],
	[4, 116.117142, 39.933403],
	[4, 116.107155, 39.939605],
	[4, 116.119319, 39.934367],
	[4, 116.115431, 39.941235],
	[4, 116.130513, 39.932182],
	[5, 116.297103, 40.046501],
	[5, 116.3653, 39.947823],
	[5, 116.265228, 39.926643],
	[5, 116.342247, 39.997197],
	[5, 116.221275, 39.985811],
	[5, 116.30782, 40.045507],
	[5, 116.263437, 40.006309],
	[5, 116.332979, 39.97616],
	[5, 116.261482, 39.896542],
	[5, 116.326392, 39.959953],
	[5, 116.312522, 39.97023],
	[5, 116.353872, 39.979344],
	[5, 116.358515, 40.03448],
	[5, 116.309906, 39.918493],
	[5, 116.337935, 39.974163],
	[5, 116.319918, 39.918266],
	[5, 116.332979, 39.97616],
	[5, 116.351822, 40.062749],
	[5, 116.307342, 39.995494],
	[5, 116.295945, 39.949737],
	[5, 116.306054, 39.92557],
	[5, 116.343552, 39.965112],
	[5, 116.284562, 39.960072],
	[5, 116.302284, 40.001641],
	[5, 116.249283, 39.905958],
	[5, 116.210223, 39.948307],
	[5, 116.208659, 39.919925],
	[5, 116.208659, 39.919925],
	[5, 116.208659, 39.919925],
	[5, 116.215645, 39.925944],
	[5, 116.215645, 39.925944],
	[5, 116.257166, 39.908433],
	[5, 116.203971, 39.925095],
	[5, 116.246865, 39.90676],
	[5, 116.352718, 39.94357],
	[5, 116.352718, 39.94357],
	[5, 116.244633, 40.079743],
	[5, 116.244633, 40.079743],
	[5, 116.263437, 40.006309],
	[6, 116.092322, 39.874655],
	[6, 116.017352, 39.93387],
	[6, 116.037275, 39.911536],
	[6, 116.099648, 39.943314],
	[6, 116.111886, 39.948245],
	[6, 116.112072, 39.932639],
	[6, 116.117142, 39.933403],
	[6, 116.107155, 39.939605],
	[6, 116.03661, 39.885747],
	[6, 116.071679, 39.938769],
	[6, 116.108748, 39.948932],
	[6, 116.113365, 39.91326],
	[6, 116.084275, 39.93363],
	[6, 115.593484, 40.027259],
	[7, 116.107557, 39.662058],
	[7, 116.221292, 39.761337],
	[7, 116.154021, 39.72458],
	[7, 116.070387, 39.696121],
	[7, 116.071098, 39.679684],
	[7, 116.1989, 39.740028],
	[7, 116.138275, 39.740188],
	[7, 116.17807, 39.7779],
	[7, 116.077376, 39.663553],
	[7, 116.196296, 39.777668],
	[7, 116.224096, 39.805886],
	[7, 116.07474, 39.677486],
	[7, 116.017684, 39.713399],
	[7, 116.0687, 39.716965],
	[7, 116.186055, 39.755927],
	[8, 116.560907, 39.766686],
	[8, 116.641433, 39.901198],
	[8, 116.640368, 39.911012],
	[8, 116.671563, 39.875658],
	[8, 116.549565, 39.745664],
	[8, 116.69407, 39.943822],
	[8, 116.687583, 39.932097],
	[8, 116.666549, 39.942635],
	[8, 116.550423, 39.755849],
	[8, 116.689705, 39.873473],
	[8, 116.594391, 39.777705],
	[8, 116.543758, 39.748025],
	[8, 116.666417, 39.893071],
	[8, 116.732265, 39.838893],
	[8, 116.698042, 39.920591],
	[8, 116.698042, 39.920591],
	[8, 116.670209, 39.887697],
	[8, 116.678574, 39.93366],
	[8, 116.688212, 39.931464],
	[8, 116.660245, 39.93252],
	[8, 116.575322, 39.743898],
	[8, 116.649569, 39.896661],
	[9, 116.559368, 40.041986],
	[9, 116.534071, 40.06264],
	[9, 116.620072, 40.201349],
	[9, 116.566185, 40.073196],
	[9, 116.525539, 40.085976],
	[9, 116.564286, 40.065291],
	[9, 116.54405, 40.07694],
	[9, 116.568329, 40.052026],
	[9, 116.575159, 40.059794],
	[9, 116.571713, 40.054668],
	[9, 116.744875, 40.120597],
	[9, 116.54982, 40.074251],
	[9, 116.660824, 40.142141],
	[9, 116.658634, 40.119322],
	[9, 116.545674, 40.10426],
	[9, 116.559948, 40.116686],
	[9, 116.676805, 40.036827],
	[9, 116.669591, 40.161929],
	[9, 116.654544, 40.126017],
	[9, 116.668943, 40.136232],
	[9, 116.729332, 40.099306],
	[9, 116.61432, 40.12145],
	[10, 116.444147, 40.061823],
	[10, 116.334632, 40.326594],
	[10, 116.078148, 40.299917],
	[10, 116.31487, 40.061033],
	[10, 116.368474, 40.069854],
	[10, 116.365569, 40.073091],
	[10, 116.455569, 40.129716],
	[10, 116.427848, 40.074954],
	[10, 116.427848, 40.074954],
	[10, 116.419377, 40.138517],
	[10, 116.285612, 40.121738],
	[10, 116.401703, 40.170611],
	[10, 116.427848, 40.074954],
	[10, 116.314007, 40.074264],
	[10, 116.440526, 40.162771],
	[10, 116.426194, 40.112352],
	[10, 116.427848, 40.074954],
	[10, 116.427848, 40.074954],
	[10, 116.427848, 40.074954],
	[10, 116.312759, 40.106842],
	[10, 116.422275, 40.150747],
	[10, 116.427848, 40.074954],
	[10, 116.427848, 40.074954],
	[10, 116.423301, 40.125194],
	[10, 116.424607, 40.156455],
	[10, 116.427848, 40.074954],
	[10, 116.455995, 40.129082],
	[10, 116.330707, 40.074769],
	[10, 116.419411, 40.146287],
	[10, 116.414545, 40.120929],
	[10, 116.427848, 40.074954],
	[10, 116.4306, 40.180978],
	[10, 116.242861, 40.215698],
	[10, 116.426069, 40.115477],
	[10, 116.395839, 40.178076],
	[10, 116.4306, 40.180978],
	[10, 116.343504, 40.097222],
	[10, 116.41224, 40.061554],
	[10, 116.317763, 40.075604],
	[10, 116.317763, 40.075604],
	[10, 116.245835, 40.218314],
	[10, 116.238392, 40.218887],
	[11, 116.50899, 39.806109],
	[11, 116.521112, 39.791972],
	[11, 116.502352, 39.799116],
	[11, 116.346427, 39.795609],
	[11, 116.489071, 39.791794],
	[11, 116.511748, 39.801839],
	[11, 116.638232, 39.664688],
	[11, 116.511748, 39.801839],
	[11, 116.349788, 39.796998],
	[11, 116.511748, 39.801839],
	[11, 116.341981, 39.754378],
	[11, 116.511748, 39.801839],
	[11, 116.335434, 39.780723],
	[11, 116.482764, 39.790352],
	[11, 116.328412, 39.678399],
	[11, 116.423706, 39.790701],
	[11, 116.323044, 39.652154],
	[11, 116.340876, 39.781515],
	[11, 116.497321, 39.804273],
	[11, 116.522337, 39.803818],
	[11, 116.331272, 39.545139],
	[11, 116.329695, 39.707779],
	[12, 116.571666, 40.345112],
	[12, 116.642044, 40.292072],
	[12, 116.637532, 40.439905],
	[12, 116.490286, 40.298596],
	[12, 116.682373, 40.291408],
	[12, 116.634669, 40.339378],
	[12, 116.649165, 40.320686],
	[12, 116.640807, 40.347066],
	[12, 116.650429, 40.339514],
	[12, 116.642042, 40.336266],
	[12, 116.641449, 40.330705],
	[12, 116.650429, 40.339514],
	[12, 116.641191, 40.319497],
	[12, 116.611857, 40.308169],
	[12, 116.638365, 40.320112],
	[12, 116.638262, 40.346942],
	[12, 116.651712, 40.297202],
	[12, 116.634758, 40.33438],
	[12, 116.648328, 40.322192],
	[12, 116.651317, 40.330289],
	[12, 116.632891, 40.329616],
	[12, 116.638478, 40.310567],
	[13, 117.311124, 40.188124],
	[13, 117.120706, 40.140573],
	[13, 117.12085, 40.145264],
	[13, 117.12085, 40.145264],
	[13, 117.12085, 40.145264],
	[13, 117.12085, 40.145264],
	[13, 117.12085, 40.145264],
	[13, 117.120637, 40.13882],
	[13, 117.10455, 40.149068],
	[13, 117.113074, 40.163725],
	[13, 117.004445, 40.054509],
	[13, 117.121554, 40.160382],
	[13, 117.12091, 40.149648],
	[13, 117.14103, 40.155305],
	[13, 117.123336, 40.145825],
	[13, 117.120706, 40.140573],
	[13, 117.135675, 40.145378],
	[13, 117.122733, 40.160645],
	[13, 117.127202, 40.158467],
	[13, 117.132871, 40.143964],
	[13, 117.109297, 40.15883],
	[13, 117.118229, 40.14051],
	[14, 117.065882, 40.587206],
	[14, 117.280107, 40.65558],
	[14, 116.87064, 40.387247],
	[14, 116.870685, 40.375427],
	[14, 116.840177, 40.369258],
	[14, 116.861518, 40.380208],
	[14, 116.861518, 40.380208],
	[14, 116.798364, 40.357824],
	[14, 116.859163, 40.385684],
	[14, 116.840599, 40.377433],
	[14, 116.852165, 40.37757],
	[14, 116.852118, 40.395875],
	[14, 116.846427, 40.36544],
	[14, 116.840599, 40.377433],
	[14, 116.83572, 40.38422],
	[14, 116.855821, 40.481617],
	[14, 116.851602, 40.392652],
	[14, 116.861095, 40.397726],
	[14, 116.87064, 40.387247],
	[14, 116.877274, 40.391252],
	[14, 116.868394, 40.377351],
	[14, 116.839834, 40.370748],
	[14, 117.128081, 40.592549],
	[14, 116.746586, 40.482513],
	[15, 115.961471, 40.436406],
	[15, 115.948379, 40.443754],
	[15, 116.357559, 40.565177],
	[15, 115.961471, 40.436406],
	[15, 115.988444, 40.469299],
	[15, 115.974618, 40.470615],
	[15, 115.982256, 40.450749],
	[15, 115.985706, 40.473989],
	[15, 115.992805, 40.45552],
	[15, 115.983181, 40.45481],
	[15, 115.999314, 40.450885],
	[15, 115.99855, 40.46902],
	[15, 115.984936, 40.366172],
	[15, 115.982624, 40.470599],
	[15, 115.967874, 40.528344],
	[15, 115.934828, 40.427464],
	[15, 115.985773, 40.456592],
	[15, 115.989949, 40.464464],
	[15, 115.772533, 40.467294]


];



//底图加载
function init() {
	map = new BMap.Map('container', {
		enableMapClick: false
	});
	map.centerAndZoom(new BMap.Point(116.397228240966, 39.909604560497), 13);
	map.enableScrollWheelZoom(true);
	//创建控件元素
	myZoomCtrl = new ZoomControl();
	//添加到地图中
	map.addControl(myZoomCtrl);

	//设置地图默认样式
	map.setMapStyleV2({
		styleJson: styleJson1
	});

/* 	//创建控件元素
	myChangeCtrl = new ChangeControl();
	//添加到地图中
	map.addControl(myChangeCtrl);
 */
}
function setCustomStyle1() {
		map.setMapStyleV2({
			styleJson: styleJson1
		});
}
function setCustomStyle2() {
		map.setMapStyleV2({
			styleJson: styleJson2
		});
}



/* //切换底图控件
function ChangeControl() {
	this.defaultAnchor = BMAP_ANCHOR_BOTTOM_LEFT;
	this.defaultOffset = new BMap.Size(20, 20)
}
//通过JavaScript的prototype属性继承于BMap.Control
ChangeControl.prototype = new BMap.Control();

//自定义控件必须实现自己的initialize方法，并且将控件的DOM元素返回
//在本方法中创建个div元素作为控件的容器，并将其添加到地图容器中
ChangeControl.prototype.initialize = function(map) {
	//创建一个dom元素
	var divv = document.createElement('div');
	//添加文字说明
	divv.appendChild(document.createTextNode('切换模式'));
	// 设置样式
	divv.style.cursor = "pointer";
	divv.style.padding = "7px 10px";
	divv.style.boxShadow = "0 2px 6px 0 rgba(27, 142, 236, 0.5)";
	divv.style.borderRadius = "5px";
	divv.style.backgroundColor = "white";
	// 绑定事件,点击一次放大两级
	divv.onclick = function(e) {
		setCustomStyle();
	}
	// 添加DOM元素到地图中
	map.getContainer().appendChild(divv);
	// 将DOM元素返回
	return divv;
} */

var styleJson1 = [{
	"featureType": "land",
	"elementType": "geometry",
	"stylers": {
		"color": "#ffffffff",
		"visibility": "on"
	}
}, {
	"featureType": "water",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#ffffffff",
		"visibility": "on"
	}
}, {
	"featureType": "building",
	"elementType": "geometry.fill",
	"stylers": {
		"color": "#f4f3f0ff",
		"visibility": "on"
	}
}, {
	"featureType": "building",
	"elementType": "geometry.stroke",
	"stylers": {
		"color": "#e5e1d7ff",
		"visibility": "on"
	}
}, {
	"featureType": "water",
	"elementType": "geometry",
	"stylers": {
		"color": "#98b2d1ff",
		"visibility": "on"
	}
}, {
	"featureType": "village",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "town",
	"elementType": "labels",
	"stylers": {
		"visibility": "on"
	}
}, {
	"featureType": "district",
	"elementType": "labels",
	"stylers": {
		"visibility": "on"
	}
}, {
	"featureType": "country",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "city",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "continent",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "poilabel",
	"elementType": "labels",
	"stylers": {
		"visibility": "on"
	}
}, {
	"featureType": "poilabel",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "scenicspotslabel",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "scenicspotslabel",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "transportationlabel",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "transportationlabel",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "airportlabel",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "airportlabel",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "road",
	"elementType": "geometry.fill",
	"stylers": {
		"color": "#9b9b9bff",
		"visibility": "on"
	}
}, {
	"featureType": "road",
	"elementType": "geometry.stroke",
	"stylers": {
		"color": "#885d64ff",
		"visibility": "on"
	}
}, {
	"featureType": "road",
	"elementType": "geometry",
	"stylers": {
		"weight": 3
	}
}, {
	"featureType": "green",
	"elementType": "geometry",
	"stylers": {
		"color": "#c2e799ff",
		"visibility": "on"
	}
}, {
	"featureType": "scenicspots",
	"elementType": "geometry",
	"stylers": {
		"color": "#ffffffff",
		"visibility": "on"
	}
}, {
	"featureType": "scenicspots",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "scenicspots",
	"elementType": "labels.text.stroke",
	"stylers": {
		"weight": 1,
		"color": "#ccb7aeff",
		"visibility": "on"
	}
}, {
	"featureType": "continent",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "country",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "city",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "city",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "scenicspotslabel",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "airportlabel",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "transportationlabel",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "railway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "subway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "highwaysign",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "nationalwaysign",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "nationalwaysign",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "provincialwaysign",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "provincialwaysign",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "tertiarywaysign",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "tertiarywaysign",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "subwaylabel",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "subwaylabel",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "road",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on",
		"weight": 90
	}
}, {
	"featureType": "road",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "shopping",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "scenicspots",
	"elementType": "labels",
	"stylers": {
		"visibility": "on"
	}
}, {
	"featureType": "scenicspotslabel",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "manmade",
	"elementType": "geometry",
	"stylers": {
		"visibility": "on"
	}
}, {
	"featureType": "manmade",
	"elementType": "labels",
	"stylers": {
		"visibility": "on"
	}
}, {
	"featureType": "highwaysign",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "water",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#70667700",
		"visibility": "on"
	}
}, {
	"featureType": "road",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "6"
	}
}, {
	"featureType": "road",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "7"
	}
}, {
	"featureType": "road",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "8"
	}
}, {
	"featureType": "road",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "9"
	}
}, {
	"featureType": "road",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "6"
	}
}, {
	"featureType": "road",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "7"
	}
}, {
	"featureType": "road",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "8"
	}
}, {
	"featureType": "road",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "9"
	}
}, {
	"featureType": "road",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "6"
	}
}, {
	"featureType": "road",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "7"
	}
}, {
	"featureType": "road",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "8"
	}
}, {
	"featureType": "road",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "9"
	}
}, {
	"featureType": "road",
	"elementType": "labels.text",
	"stylers": {
		"fontsize": 24
	}
}, {
	"featureType": "highway",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "highway",
	"elementType": "geometry.fill",
	"stylers": {
		"color": "#a6808cff",
		"visibility": "on"
	}
}, {
	"featureType": "highway",
	"elementType": "geometry.stroke",
	"stylers": {
		"color": "#1c4f7eff"
	}
}, {
	"featureType": "highway",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "highway",
	"elementType": "geometry",
	"stylers": {
		"weight": 3
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry.fill",
	"stylers": {
		"color": "#a6808cff",
		"visibility": "on"
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry.stroke",
	"stylers": {
		"color": "#1c4f7eff"
	}
}, {
	"featureType": "nationalway",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "nationalway",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry",
	"stylers": {
		"weight": 3
	}
}, {
	"featureType": "provincialway",
	"elementType": "geometry.fill",
	"stylers": {
		"color": "#a6808cff",
		"visibility": "on"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry.fill",
	"stylers": {
		"color": "#9b9b9bff",
		"visibility": "on"
	}
}, {
	"featureType": "arterial",
	"elementType": "geometry.fill",
	"stylers": {
		"color": "#9b9b9bff",
		"visibility": "on"
	}
}, {
	"featureType": "tertiaryway",
	"elementType": "geometry.fill",
	"stylers": {
		"color": "#a6808cff",
		"visibility": "on"
	}
}, {
	"featureType": "fourlevelway",
	"elementType": "geometry.fill",
	"stylers": {
		"color": "#a6808cff",
		"visibility": "on"
	}
}, {
	"featureType": "local",
	"elementType": "geometry.fill",
	"stylers": {
		"color": "#a6808cff",
		"visibility": "on"
	}
}, {
	"featureType": "provincialway",
	"elementType": "geometry.stroke",
	"stylers": {
		"color": "#885d64ff",
		"visibility": "on"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry.stroke",
	"stylers": {
		"color": "#885d64ff",
		"visibility": "on"
	}
}, {
	"featureType": "arterial",
	"elementType": "geometry.stroke",
	"stylers": {
		"color": "#885d64ff",
		"visibility": "on"
	}
}, {
	"featureType": "tertiaryway",
	"elementType": "geometry.stroke",
	"stylers": {
		"color": "#885d64ff",
		"visibility": "on"
	}
}, {
	"featureType": "fourlevelway",
	"elementType": "geometry.stroke",
	"stylers": {
		"color": "#885d64ff",
		"visibility": "on"
	}
}, {
	"featureType": "local",
	"elementType": "geometry.stroke",
	"stylers": {
		"color": "#885d64ff",
		"visibility": "on"
	}
}, {
	"featureType": "local",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "local",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "fourlevelway",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "tertiaryway",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "arterial",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "provincialway",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#d6cfcbff",
		"visibility": "on"
	}
}, {
	"featureType": "provincialway",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "cityhighway",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "arterial",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "tertiaryway",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "fourlevelway",
	"elementType": "labels.text.stroke",
	"stylers": {
		"color": "#ccb7aeff",
		"visibility": "on",
		"weight": 1
	}
}, {
	"featureType": "fourlevelway",
	"elementType": "geometry",
	"stylers": {
		"weight": 1
	}
}, {
	"featureType": "tertiaryway",
	"elementType": "geometry",
	"stylers": {
		"weight": 1
	}
}, {
	"featureType": "local",
	"elementType": "geometry",
	"stylers": {
		"weight": 1
	}
}, {
	"featureType": "provincialway",
	"elementType": "geometry",
	"stylers": {
		"weight": 3
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry",
	"stylers": {
		"weight": 3
	}
}, {
	"featureType": "arterial",
	"elementType": "geometry",
	"stylers": {
		"weight": 3
	}
}, {
	"featureType": "highway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "6"
	}
}, {
	"featureType": "highway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "7"
	}
}, {
	"featureType": "highway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "8"
	}
}, {
	"featureType": "highway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "9"
	}
}, {
	"featureType": "highway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "6"
	}
}, {
	"featureType": "highway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "7"
	}
}, {
	"featureType": "highway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "8"
	}
}, {
	"featureType": "highway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "9"
	}
}, {
	"featureType": "highway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "6"
	}
}, {
	"featureType": "highway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "7"
	}
}, {
	"featureType": "highway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "8"
	}
}, {
	"featureType": "highway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "9"
	}
}, {
	"featureType": "nationalway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "6"
	}
}, {
	"featureType": "nationalway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "7"
	}
}, {
	"featureType": "nationalway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "8"
	}
}, {
	"featureType": "nationalway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "9"
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "6"
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "7"
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "8"
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "9"
	}
}, {
	"featureType": "nationalway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "6"
	}
}, {
	"featureType": "nationalway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "7"
	}
}, {
	"featureType": "nationalway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "8"
	}
}, {
	"featureType": "nationalway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "9"
	}
}, {
	"featureType": "provincialway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "8,10",
		"level": "8"
	}
}, {
	"featureType": "provincialway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "8,10",
		"level": "9"
	}
}, {
	"featureType": "provincialway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "8,10",
		"level": "8"
	}
}, {
	"featureType": "provincialway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "8,10",
		"level": "9"
	}
}, {
	"featureType": "provincialway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "8,10",
		"level": "8"
	}
}, {
	"featureType": "provincialway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "8,10",
		"level": "9"
	}
}, {
	"featureType": "cityhighway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "6"
	}
}, {
	"featureType": "cityhighway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "7"
	}
}, {
	"featureType": "cityhighway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "8"
	}
}, {
	"featureType": "cityhighway",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "9"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "6"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "7"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "8"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "9"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "6"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "7"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "8"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "6,9",
		"level": "9"
	}
}, {
	"featureType": "arterial",
	"stylers": {
		"curZoomRegionId": "0",
		"curZoomRegion": "9,9",
		"level": "9"
	}
}, {
	"featureType": "arterial",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "9,9",
		"level": "9"
	}
}, {
	"featureType": "arterial",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"curZoomRegionId": "0",
		"curZoomRegion": "9,9",
		"level": "9"
	}
}, {
	"featureType": "building",
	"elementType": "geometry.topfill",
	"stylers": {
		"color": "#9b9b9bff"
	}
}, {
	"featureType": "subwaystation",
	"elementType": "geometry",
	"stylers": {
		"color": "#9b9b9bff"
	}
}, {
	"featureType": "education",
	"elementType": "geometry",
	"stylers": {
		"color": "#71aac0ff"
	}
}, {
	"featureType": "medical",
	"elementType": "geometry",
	"stylers": {
		"color": "#ffffffff"
	}
}, {
	"featureType": "airportlabel",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "entertainmentlabel",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "estatelabel",
	"elementType": "labels.text.fill",
	"stylers": {
		"color": "#9b9b9bff"
	}
}, {
	"featureType": "businesstowerlabel",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}];

var styleJson2 = [{
	"featureType": "land",
	"elementType": "geometry",
	"stylers": {
		"visibility": "on",
		"color": "#ffffffff"
	}
}, {
	"featureType": "water",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#9b9b9bff"
	}
}, {
	"featureType": "building",
	"elementType": "geometry.fill",
	"stylers": {
		"visibility": "on",
		"color": "#2b152fff"
	}
}, {
	"featureType": "building",
	"elementType": "geometry.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#1c0316ff"
	}
}, {
	"featureType": "water",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"color": "#76979cff"
	}
}, {
	"featureType": "village",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "town",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "district",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "country",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "city",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "continent",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "poilabel",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "poilabel",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "scenicspotslabel",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "scenicspotslabel",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "transportationlabel",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "transportationlabel",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "airportlabel",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "airportlabel",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "road",
	"elementType": "geometry.fill",
	"stylers": {
		"visibility": "on",
		"color": "#8b572aff"
	}
}, {
	"featureType": "road",
	"elementType": "geometry.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#455365ff"
	}
}, {
	"featureType": "road",
	"elementType": "geometry",
	"stylers": {
		"visibility": "on",
		"weight": "8"
	}
}, {
	"featureType": "green",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"color": "#a1cc75ff"
	}
}, {
	"featureType": "scenicspots",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"color": "#36213eff"
	}
}, {
	"featureType": "scenicspots",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "scenicspots",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "continent",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "country",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "city",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "city",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "scenicspotslabel",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "airportlabel",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "transportationlabel",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "railway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "subway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "on"
	}
}, {
	"featureType": "highwaysign",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "nationalwaysign",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "nationalwaysign",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "provincialwaysign",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "provincialwaysign",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "tertiarywaysign",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "tertiarywaysign",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "subwaylabel",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "subwaylabel",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "road",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff",
		"weight": "90"
	}
}, {
	"featureType": "road",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "shopping",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "scenicspots",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "scenicspotslabel",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "manmade",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "manmade",
	"elementType": "labels",
	"stylers": {
		"visibility": "on"
	}
}, {
	"featureType": "highwaysign",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "water",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#55497100"
	}
}, {
	"featureType": "road",
	"stylers": {
		"level": "6",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "road",
	"stylers": {
		"level": "7",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "road",
	"stylers": {
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "road",
	"stylers": {
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "road",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "6",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "road",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "7",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "road",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "road",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "road",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "6",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "road",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "7",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "road",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "road",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "road",
	"elementType": "labels.text",
	"stylers": {
		"fontsize": "24"
	}
}, {
	"featureType": "highway",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "highway",
	"elementType": "geometry.fill",
	"stylers": {
		"visibility": "on",
		"color": "#8b572aff"
	}
}, {
	"featureType": "highway",
	"elementType": "geometry.stroke",
	"stylers": {
		"color": "#1c4f7eff"
	}
}, {
	"featureType": "highway",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "highway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"weight": "3"
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry.fill",
	"stylers": {
		"visibility": "on",
		"color": "#8b572aff"
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry.stroke",
	"stylers": {
		"color": "#1c4f7eff"
	}
}, {
	"featureType": "nationalway",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "nationalway",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"weight": "3"
	}
}, {
	"featureType": "provincialway",
	"elementType": "geometry.fill",
	"stylers": {
		"visibility": "on",
		"color": "#8b572aff"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry.fill",
	"stylers": {
		"visibility": "on",
		"color": "#8b572aff"
	}
}, {
	"featureType": "arterial",
	"elementType": "geometry.fill",
	"stylers": {
		"visibility": "on",
		"color": "#8b572aff"
	}
}, {
	"featureType": "tertiaryway",
	"elementType": "geometry.fill",
	"stylers": {
		"visibility": "on",
		"color": "#8b572aff"
	}
}, {
	"featureType": "fourlevelway",
	"elementType": "geometry.fill",
	"stylers": {
		"visibility": "on",
		"color": "#8b572aff"
	}
}, {
	"featureType": "local",
	"elementType": "geometry.fill",
	"stylers": {
		"visibility": "on",
		"color": "#8b572aff"
	}
}, {
	"featureType": "provincialway",
	"elementType": "geometry.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#455365ff"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#455365ff"
	}
}, {
	"featureType": "arterial",
	"elementType": "geometry.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#455365ff"
	}
}, {
	"featureType": "tertiaryway",
	"elementType": "geometry.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#455365ff"
	}
}, {
	"featureType": "fourlevelway",
	"elementType": "geometry.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#455365ff"
	}
}, {
	"featureType": "local",
	"elementType": "geometry.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#455365ff"
	}
}, {
	"featureType": "local",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "local",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "fourlevelway",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "tertiaryway",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "arterial",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "provincialway",
	"elementType": "labels.text.fill",
	"stylers": {
		"visibility": "on",
		"color": "#b8f3ffff"
	}
}, {
	"featureType": "provincialway",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "arterial",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "tertiaryway",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "fourlevelway",
	"elementType": "labels.text.stroke",
	"stylers": {
		"visibility": "on",
		"color": "#8ac6d0ff",
		"weight": "1"
	}
}, {
	"featureType": "fourlevelway",
	"elementType": "geometry",
	"stylers": {
		"weight": "1"
	}
}, {
	"featureType": "tertiaryway",
	"elementType": "geometry",
	"stylers": {
		"weight": "1"
	}
}, {
	"featureType": "local",
	"elementType": "geometry",
	"stylers": {
		"weight": "1"
	}
}, {
	"featureType": "provincialway",
	"elementType": "geometry",
	"stylers": {
		"weight": "3"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry",
	"stylers": {
		"weight": "3"
	}
}, {
	"featureType": "arterial",
	"elementType": "geometry",
	"stylers": {
		"weight": "3"
	}
}, {
	"featureType": "highway",
	"stylers": {
		"level": "6",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "highway",
	"stylers": {
		"level": "7",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "highway",
	"stylers": {
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "highway",
	"stylers": {
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "highway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "6",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "highway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "7",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "highway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "highway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "highway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "6",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "highway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "7",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "highway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "highway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "nationalway",
	"stylers": {
		"level": "6",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "nationalway",
	"stylers": {
		"level": "7",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "nationalway",
	"stylers": {
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "nationalway",
	"stylers": {
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "6",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "7",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "nationalway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "nationalway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "6",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "nationalway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "7",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "nationalway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "nationalway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "provincialway",
	"stylers": {
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "8-10"
	}
}, {
	"featureType": "provincialway",
	"stylers": {
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "8-10"
	}
}, {
	"featureType": "provincialway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "8-10"
	}
}, {
	"featureType": "provincialway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "8-10"
	}
}, {
	"featureType": "provincialway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "8-10"
	}
}, {
	"featureType": "provincialway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "8-10"
	}
}, {
	"featureType": "cityhighway",
	"stylers": {
		"level": "6",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "cityhighway",
	"stylers": {
		"level": "7",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "cityhighway",
	"stylers": {
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "cityhighway",
	"stylers": {
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "6",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "7",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "6",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "7",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "8",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "cityhighway",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "6-9"
	}
}, {
	"featureType": "arterial",
	"stylers": {
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "9-9"
	}
}, {
	"featureType": "arterial",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off",
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "9-9"
	}
}, {
	"featureType": "arterial",
	"elementType": "labels",
	"stylers": {
		"visibility": "off",
		"level": "9",
		"curZoomRegionId": "0",
		"curZoomRegion": "9-9"
	}
}, {
	"featureType": "background",
	"elementType": "geometry",
	"stylers": {
		"visibility": "on",
		"color": "#ffffffff"
	}
}, {
	"featureType": "local",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "road",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "subway",
	"elementType": "geometry.fill",
	"stylers": {
		"color": "#8b572aff"
	}
}, {
	"featureType": "roadarrow",
	"elementType": "labels.icon",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "water",
	"elementType": "labels",
	"stylers": {
		"visibility": "on"
	}
}, {
	"featureType": "education",
	"elementType": "labels",
	"stylers": {
		"visibility": "on"
	}
}, {
	"featureType": "medical",
	"elementType": "labels",
	"stylers": {
		"visibility": "on"
	}
}, {
	"featureType": "building",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "education",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "medical",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "entertainment",
	"elementType": "geometry",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "estate",
	"elementType": "geometry",
	"stylers": {
		"visibility": "on"
	}
}, {
	"featureType": "shoppinglabel",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}, {
	"featureType": "entertainmentlabel",
	"elementType": "labels",
	"stylers": {
		"visibility": "off"
	}
}]
